InformationRegisters/СкидкиНаценкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СкидкиНаценкиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСкидкиНаценки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Меню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Меню</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыМеню</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СкидкиНаценкиНоменклатуры/Ext/ManagerModule.bsl
Процедура ПолучитьСкидкиНаценкиНоменклатуры(Ссылка, Объект) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы, СправочникСсылка.Номенклатура");
	
	// Деревов правил использования.
	СкидкиНаценкиНоменклатуры = Новый ДеревоЗначений;
	СкидкиНаценкиНоменклатуры.Колонки.Добавить("Номенклатура", ОписаниеТипов);
	СкидкиНаценкиНоменклатуры.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"), "Представление");
	СкидкиНаценкиНоменклатуры.Колонки.Добавить("Актуальность", Новый ОписаниеТипов("Булево"), "Актуальность");
	СкидкиНаценкиНоменклатуры.Колонки.Добавить("ПроцентСкидкиНаценки", Новый ОписаниеТипов("Число"), "Номинал");
	СкидкиНаценкиНоменклатуры.Колонки.Добавить("ПроцентСкидкиНаценкиИзменен", Новый ОписаниеТипов("Булево"), "Номинал изменен");
	СкидкиНаценкиНоменклатуры.Колонки.Добавить("ТолькоПросмотр", Новый ОписаниеТипов("Булево"), "Только просмотр");
	СкидкиНаценкиНоменклатуры.Колонки.Добавить("ИндексКартинки", Новый ОписаниеТипов("Число"), "Картинка");
	
	// Заполнение данных.
	Для Каждого ДопустимыйТипы Из ОписаниеТипов.Типы() Цикл

		ОбъектМетаданных = Метаданные.НайтиПоТипу(ДопустимыйТипы);
		
		// Запрос.
		Если ОбъектМетаданных.Владельцы.Количество() Тогда
			Подчиненный = Истина;
			
			Если ОбъектМетаданных.Иерархический Тогда
				Если (ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияЭлементов) Тогда
					ТекстЗапроса = "ВЫБРАТЬ
					               |	Меню.Владелец,
					               |	Меню.Владелец.Представление КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК Номенклатура,
					               |	Меню.Представление,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 100) = 0
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК Актуальность,
					               |	ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, &ПроцентСкидкиНаценки) = &ПроцентСкидкиНаценки
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК ПроцентСкидкиНаценкиИзменен,
					               |	ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
					               |		ПО (СкидкиНаценкиНоменклатуры.Номенклатура = Меню.Ссылка)
					               |			И (СкидкиНаценкиНоменклатуры.ТипСкидкиНаценки = &Владелец)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Меню.Ссылка ИЕРАРХИЯ
					               |АВТОУПОРЯДОЧИВАНИЕ";
				Иначе
					ТекстЗапроса = "ВЫБРАТЬ
					               |	Меню.Владелец,
					               |	Меню.Владелец.Представление КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК Номенклатура,
					               |	Меню.Представление,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 100) = 0
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК Актуальность,
					               |	ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, &ПроцентСкидкиНаценки) = &ПроцентСкидкиНаценки
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК ПроцентСкидкиНаценкиИзменен,
					               |	ВЫБОР
					               |		КОГДА Меню.ЭтоГруппа
					               |			ТОГДА 2
					               |		ИНАЧЕ 0
					               |	КОНЕЦ + ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
					               |		ПО (СкидкиНаценкиНоменклатуры.Номенклатура = Меню.Ссылка)
					               |			И (СкидкиНаценкиНоменклатуры.ТипСкидкиНаценки = &Владелец)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Меню.Ссылка ИЕРАРХИЯ
					               |АВТОУПОРЯДОЧИВАНИЕ";
				КонецЕсли;
			Иначе
					ТекстЗапроса = "ВЫБРАТЬ
					               |	Меню.Владелец,
					               |	Меню.Владелец.Представление КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК Номенклатура,
					               |	Меню.Представление,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 100) = 0
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК Актуальность,
					               |	ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, &ПроцентСкидкиНаценки) = &ПроцентСкидкиНаценки
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК ПроцентСкидкиНаценкиИзменен,
					               |	ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
					               |		ПО (СкидкиНаценкиНоменклатуры.Номенклатура = Меню.Ссылка)
					               |			И (СкидкиНаценкиНоменклатуры.ТипСкидкиНаценки = &Владелец)
					               |АВТОУПОРЯДОЧИВАНИЕ";
			КонецЕсли;
		Иначе
			Подчиненный = Ложь;
			
			Если (ОбъектМетаданных.Иерархический) Тогда
				Если (ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияЭлементов) Тогда
					ТекстЗапроса = "ВЫБРАТЬ
					               |	НЕОПРЕДЕЛЕНО КАК Владелец,
					               |	НЕОПРЕДЕЛЕНО КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК Номенклатура,
					               |	Меню.Представление,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 100) = 0
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК Актуальность,
					               |	ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, &ПроцентСкидкиНаценки) = &ПроцентСкидкиНаценки
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК ПроцентСкидкиНаценкиИзменен,
					               |	ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
					               |		ПО (СкидкиНаценкиНоменклатуры.Номенклатура = Меню.Ссылка)
					               |			И (СкидкиНаценкиНоменклатуры.ТипСкидкиНаценки = &Владелец)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Меню.Ссылка ИЕРАРХИЯ
					               |АВТОУПОРЯДОЧИВАНИЕ";
				Иначе
					ТекстЗапроса = "ВЫБРАТЬ
					               |	НЕОПРЕДЕЛЕНО КАК Владелец,
					               |	НЕОПРЕДЕЛЕНО КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК Номенклатура,
					               |	Меню.Представление,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 100) = 0
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК Актуальность,
					               |	ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, &ПроцентСкидкиНаценки) = &ПроцентСкидкиНаценки
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК ПроцентСкидкиНаценкиИзменен,
					               |	ВЫБОР
					               |		КОГДА Меню.ЭтоГруппа
					               |			ТОГДА 2
					               |		ИНАЧЕ 0
					               |	КОНЕЦ + ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
					               |		ПО (СкидкиНаценкиНоменклатуры.Номенклатура = Меню.Ссылка)
					               |			И (СкидкиНаценкиНоменклатуры.ТипСкидкиНаценки = &Владелец)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Меню.Ссылка ИЕРАРХИЯ
					               |АВТОУПОРЯДОЧИВАНИЕ";
				КонецЕсли;
			Иначе
					ТекстЗапроса = "ВЫБРАТЬ
					               |	НЕОПРЕДЕЛЕНО КАК Владелец,
					               |	НЕОПРЕДЕЛЕНО КАК ВладелецПредставление,
					               |	Меню.Ссылка КАК Номенклатура,
					               |	Меню.Представление,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 100) = 0
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК Актуальность,
					               |	ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, 0) КАК ПроцентСкидкиНаценки,
					               |	ВЫБОР
					               |		КОГДА ЕСТЬNULL(СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки, &ПроцентСкидкиНаценки) = &ПроцентСкидкиНаценки
					               |			ТОГДА ЛОЖЬ
					               |		ИНАЧЕ ИСТИНА
					               |	КОНЕЦ КАК ПроцентСкидкиНаценкиИзменен,
					               |	ВЫБОР
					               |		КОГДА Меню.ПометкаУдаления
					               |			ТОГДА 1
					               |		ИНАЧЕ 0
					               |	КОНЕЦ КАК ИндексКартинки
					               |ИЗ
					               |	Справочник.Меню КАК Меню
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
					               |		ПО (СкидкиНаценкиНоменклатуры.Номенклатура = Меню.Ссылка)
					               |			И (СкидкиНаценкиНоменклатуры.ТипСкидкиНаценки = &Владелец)
					               |АВТОУПОРЯДОЧИВАНИЕ";
			КонецЕсли;
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Меню", "Справочник." + ОбъектМетаданных.Имя);
	
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Владелец", Ссылка.Ссылка);
		Запрос.УстановитьПараметр("ПроцентСкидкиНаценки", Ссылка.ПроцентСкидкиНаценки);
		
		ПромежуточныйРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		// Нисходящий обход дерева.
		КорневойРодитель = СкидкиНаценкиНоменклатуры.Строки.Добавить();
		КорневойРодитель.Представление = ОбъектМетаданных.Синоним;
		КорневойРодитель.Номенклатура = Справочники[ОбъектМетаданных.Имя].ПустаяСсылка();
		КорневойРодитель.ТолькоПросмотр = Истина;
		КорневойРодитель.ИндексКартинки = 5;
		КорневойРодитель = КорневойРодитель.Строки;
		
		СоответсвиеРодителей = Новый Соответствие; МассивПодчиненных = Новый Массив; МассивПодчиненных.Добавить(ПромежуточныйРезультат.Строки);

		Для Каждого РодительЭлементы Из МассивПодчиненных Цикл
			Для Каждого ПодчиненныеДанные Из РодительЭлементы Цикл
				
				Если (ПодчиненныеДанные.Родитель = Неопределено) Тогда
					Если Подчиненный Тогда
						ВладелецРодитель = СоответсвиеРодителей[ПодчиненныеДанные.Владелец];
						
						Если (ВладелецРодитель = Неопределено) Тогда
							ВладелецРодитель = КорневойРодитель.Добавить();
							ВладелецРодитель.Представление = ПодчиненныеДанные.ВладелецПредставление;
							ВладелецРодитель.Номенклатура = ПодчиненныеДанные.Владелец;
							ВладелецРодитель.ТолькоПросмотр = Истина;
							ВладелецРодитель.ИндексКартинки = 4;
							ВладелецРодитель = ВладелецРодитель.Строки;
							
							СоответсвиеРодителей[ПодчиненныеДанные.Владелец] = ВладелецРодитель;
						КонецЕсли; 
						
						СтрокаДанных = ВладелецРодитель.Добавить();
					Иначе
						СтрокаДанных = КорневойРодитель.Добавить();
					КонецЕсли; 
				Иначе
					СтрокаДанных = СоответсвиеРодителей[ПодчиненныеДанные.Родитель].Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтрокаДанных, ПодчиненныеДанные);
				
				ПодчиненныеДанныеЭлементы = ПодчиненныеДанные.Строки; 
				Если ПодчиненныеДанныеЭлементы.Количество() Тогда
					МассивПодчиненных.Добавить(ПодчиненныеДанныеЭлементы);
					СоответсвиеРодителей[ПодчиненныеДанные] = СтрокаДанных.Строки;
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла;
			
	КонецЦикла;
	
	ЗначениеВДанныеФормы(СкидкиНаценкиНоменклатуры, Объект);	

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПолучитьСкидкиНаценкиНоменклатуры()

Процедура УстановитьСкидкиНаценкиНоменклатуры(Ссылка, Объект, Отказ) Экспорт

	Если Не Отказ Тогда

		УстановитьПривилегированныйРежим(Истина);
		
		СкидкиНаценкиНоменклатуры = ДанныеФормыВЗначение(Объект, Тип("ДеревоЗначений"));
		
		НаборЗаписей = РегистрыСведений.СкидкиНаценкиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипСкидкиНаценки.Установить(Ссылка.Ссылка);
		
		// Актуальные.
		Для Каждого СтрокаСкидкиНаценкиНоменклатуры Из СкидкиНаценкиНоменклатуры.Строки.НайтиСтроки(Новый Структура("ПроцентСкидкиНаценкиИзменен,ТолькоПросмотр", Истина, Ложь), Истина) Цикл 
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаСкидкиНаценкиНоменклатуры);
			Запись.ТипСкидкиНаценки = Ссылка.Ссылка;
		КонецЦикла; 

		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			// ERR
			Отказ = Истина;
		КонецПопытки;

		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьСкидкиНаценкиНоменклатуры()
